#pragma once

__declspec(selectany)
struct {
	LPCTSTR const full;
	LPCTSTR const abbr;
} g_characters[] = {
	{ _T("博麗霊夢"),				_T("霊夢") },
	{ _T("霧雨魔理沙"),				_T("魔理沙") },
	{ _T("十六夜咲夜"),				_T("咲夜") },
	{ _T("アリス・マーガトロイド"),	_T("アリス") },
	{ _T("パチュリー・ノーレッジ"),	_T("パチュリー") },
	{ _T("魂魄妖夢"),				_T("妖夢") },
	{ _T("レミリア・スカーレット"),	_T("レミリア") },
	{ _T("西行寺幽々子"),			_T("幽々子") },
	{ _T("八雲紫"),					_T("紫") },
	{ _T("伊吹萃香"),				_T("萃香") },
	{ _T("鈴仙・Ｕ・イナバ"),		_T("鈴仙") },
	{ _T("射命丸文"),				_T("文") },
	{ _T("小野塚小町"),				_T("小町") },
	{ _T("永江衣玖"),				_T("衣玖") },
	{ _T("比那名居天子"),			_T("天子") },
	{ _T("東風谷早苗"),				_T("早苗") },
	{ _T("チルノ"),					_T("チルノ") },
	{ _T("紅美鈴"),					_T("美鈴") },
	{ _T("霊烏路空"),				_T("空") },
	{ _T("洩矢諏訪子"),				_T("諏訪子") }
};
